Table of Contents
 Class IdeaStatiCaSetupTools
Namespace
IdeaStatiCa.Plugin.Utilities
Assembly
IdeaStatiCa.Plugin.dll
Tools for getting information about installation of IdeaStatiCa on the local machine
public static class IdeaStatiCaSetupTools
Inheritance
object
IdeaStatiCaSetupTools
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Fields
 IdeaStatiCaRegistryKey
public const string IdeaStatiCaRegistryKey = "SOFTWARE\\IDEAStatiCa"
Field Value
string
Methods
 GetIdeaStatiCaInstallDir(string)
Get the installation folder for IdeaStatiCa version
public static string GetIdeaStatiCaInstallDir(string version)
Parameters
version string
Required version
Returns
string
Path to the installation directory
Exceptions
Exception
Exception is thrown if version is not installed.
 Edit this page